abt-st/FIRMWARE-UPDATE-QUBE-ESP32/src/firmware/esp32_qube_l298n/esp32_qube_l298n.ino
void zeroPositionHere() {
  positionOffsetDeg = getRawPositionDeg();
}

void resetPid() {
  integralTerm = 0.0f;
  prevPos = getPositionDeg();
  filteredVel = 0.0f;
}
void setMotor(int pwmValue) {
  // Soft saturation: reducir PWM gradualmente cerca de los límites mecánicos del servo.
  // Factor = 1 / (1 + (|pos|/k)^y), con k=80° (umbral) y y=2 (agresividad).
  // En pos=0: factor=1.0 (PWM completo). En pos=45°: factor=0.76. En pos=80°: factor=0.50.
  float pos_factor = 1.0f / (1.0f + powf(fabsf(lastServoPos) / 80.0f, 2.0f));
  pwmValue = (int)(pwmValue * pos_factor);
  pwmValue = constrain(pwmValue, -255, 255);
  lastPwmCmd = pwmValue;

  if (USE_ENA_PWM) {
    if (pwmValue > 0) {
      digitalWrite(PIN_IN1, HIGH);
      digitalWrite(PIN_IN2, LOW);
      pwmWriteCompat(PIN_ENA, PWM_CH_ENA, pwmValue);
      return;
    }

    if (pwmValue < 0) {
      digitalWrite(PIN_IN1, LOW);
      digitalWrite(PIN_IN2, HIGH);
      pwmWriteCompat(PIN_ENA, PWM_CH_ENA, -pwmValue);
      return;
    }

    digitalWrite(PIN_IN1, LOW);
    digitalWrite(PIN_IN2, LOW);
    pwmWriteCompat(PIN_ENA, PWM_CH_ENA, 0);
    return;
  }

  if (pwmValue > 0) {
    pwmWriteCompat(PIN_IN1, PWM_CH_IN1, pwmValue);
    pwmWriteCompat(PIN_IN2, PWM_CH_IN2, 0);
    return;
  }

  if (pwmValue < 0) {
    pwmWriteCompat(PIN_IN1, PWM_CH_IN1, 0);
    pwmWriteCompat(PIN_IN2, PWM_CH_IN2, -pwmValue);
    return;
  }

  // pwmValue == 0: ambos INx a 0

  pwmWriteCompat(PIN_IN1, PWM_CH_IN1, 0);
  pwmWriteCompat(PIN_IN2, PWM_CH_IN2, 0);
}

void setMode(int newMode) {
  // Punto único de cambio de modo. Usado por HTTP y Serial para garantizar
  // que las mismas rutinas de reset y flags se ejecuten siempre.
  if (newMode < 0 || newMode > 5) return;
  mode = newMode;
  swing_recovering = false;  // Reset recovery state al cambiar de modo
  resetPid();
  if (mode == 4) {
    resetLqr();
    lqr_inFallback = false;
    lqr_fallbackMs = 0;
    spinCooldownMs = 0;  // Reset cooldown anti-spin para no interferir con LQR
  }
  if (mode == 0) {
    setMotor(0);
    lqr_inFallback = false;
  }
}

void safeStop() {
  setMode(0);
}

// Watchdog del INA219: cada WATCHDOG_PERIOD_MS verificamos que el sensor
// sigue respondiendo en I2C. Si falla, marcamos inaOk=false y reintentamos
// la inicialización con la lista de direcciones candidatas.
static unsigned long lastInaWatchdogMs = 0;
void updateIna219() {
  const unsigned long nowMs = millis();
  if (inaOk && (nowMs - lastInaWatchdogMs) >= INA_WATCHDOG_PERIOD_MS) {
    lastInaWatchdogMs = nowMs;
    // ACK-poll: si el dispositivo no responde, endTransmission() != 0.
    Wire.beginTransmission(inaAddr);
    if (Wire.endTransmission() != 0) {
      inaOk = false;
      Serial.println("[INA219] Watchdog: sensor no responde, reintentando…");
    }
  }
  if (!inaOk) {
    // Reintentar inicialización cada WATCHDOG_PERIOD_MS
    if (nowMs - lastInaWatchdogMs == 0 || (nowMs - lastInaWatchdogMs) >= INA_WATCHDOG_PERIOD_MS) {
      inaOk = initIna219();
      if (inaOk) Serial.println("[INA219] Re-inicializado OK");
    }
    return;
  }
  shuntVoltagemV = ina219.getShuntVoltage_mV();
  busVoltageV = ina219.getBusVoltage_V();
  currentmA = ina219.getCurrent_mA();
  powermW = ina219.getBusPower();
}

String getStateJson() {
  updateIna219();
  // Servo encoder
  const long c = getEncoderCountAtomic();
  const int encA = digitalRead(PIN_ENC_A);
  const int encB = digitalRead(PIN_ENC_B);
  const float rawPos = encoderDir * c * getDegPerCount();
  const float pos = rawPos - positionOffsetDeg;
  const float err = setpoint_deg - pos;

  // Pendulum encoder
  const long pc = getPendulumCountAtomic();
  const float rawPendPos = pendulumDir * pc * getPendulumDegPerCount();
  const float pendPos = rawPendPos - pendulumOffsetDeg;
  // (pendulum setpoint/error removed — no PID pendulum)

  String json = "{";
  json += "\"mode\":" + String(mode) + ",";
  // Servo
  json += "\"count\":" + String(c) + ",";
  json += "\"enc_a\":" + String(encA) + ",";
  json += "\"enc_b\":" + String(encB) + ",";
  json += "\"encoder_dir\":" + String(encoderDir) + ",";
  json += "\"counts_per_rev\":" + String(countsPerRev, 3) + ",";
  json += "\"raw_position_deg\":" + String(rawPos, 3) + ",";
  json += "\"position_deg\":" + String(pos, 3) + ",";
  json += "\"offset_deg\":" + String(positionOffsetDeg, 3) + ",";
  json += "\"setpoint_deg\":" + String(setpoint_deg, 3) + ",";
  json += "\"error_deg\":" + String(err, 3) + ",";
  // Pendulum
  json += "\"pend_count\":" + String(pc) + ",";
  json += "\"pend_raw_position_deg\":" + String(rawPendPos, 3) + ",";
  json += "\"pend_position_deg\":" + String(pendPos, 3) + ",";
  json += "\"pend_offset_deg\":" + String(pendulumOffsetDeg, 3) + ",";
  // Motor & power
  json += "\"pwm\":" + String(lastPwmCmd) + ",";
  json += "\"gain_scheduling\":" + String(useGainScheduling ? "true" : "false") + ",";
  json += "\"gain_mode\":" + String(gainMode) + ",";
  json += "\"ina_ok\":" + String(inaOk ? "true" : "false") + ",";
  json += "\"v_bus\":" + String(busVoltageV, 3) + ",";
  json += "\"v_shunt_mv\":" + String(shuntVoltagemV, 3) + ",";
  json += "\"i_ma\":" + String(currentmA, 3) + ",";
  json += "\"p_mw\":" + String(powermW, 3) + ",";
  json += "\"servo_ff_pwm\":" + String(servo_ff_pwm, 1) + ",";
  json += "\"vel_alpha\":" + String(velAlpha, 3);
  json += "}";
  return json;
}

void handleOptions(AsyncWebServerRequest *request) {
  AsyncWebServerResponse *response = request->beginResponse(204);
  response->addHeader("Access-Control-Allow-Origin", "*");
  response->addHeader("Access-Control-Allow-Methods", "GET, OPTIONS");
  response->addHeader("Access-Control-Allow-Headers", "*");
  request->send(response);
}
volatile bool fsUploadOk = false;
void handleUpdate(AsyncWebServerRequest *request) {
  AsyncWebServerResponse *response = request->beginResponse(
    Update.hasError() ? 500 : 200,
    "application/json",
    Update.hasError() ? "{\"ok\":false}" : "{\"ok\":true}");
  response->addHeader("Access-Control-Allow-Origin", "*");
  request->send(response);
  if (!Update.hasError()) {
    delay(500);
    ESP.restart();
  }
}


void handleState(AsyncWebServerRequest *request) {
  request->send(200, "application/json", getStateJson());
}

void handleCmd(AsyncWebServerRequest *request) {
  if (request->hasParam("m")) {
    const int m = request->getParam("m")->value().toInt();
    if (m >= 0 && m <= 5) {
      setMode(m);
      lastCommandMs = millis();
    }
  }

  if (request->hasParam("s")) {
    setpoint_deg = request->getParam("s")->value().toFloat();
    resetPid();
    lastCommandMs = millis();
  }


  if (request->hasParam("z")) {
    zeroPositionHere();
    setpoint_deg = 0.0f;
    resetPid();
    lastCommandMs = millis();
  }

  if (request->hasParam("zp")) {
    zeroPendulumHere();
    lastCommandMs = millis();
  }

  if (request->hasParam("o")) {
    positionOffsetDeg = request->getParam("o")->value().toFloat();
    resetPid();
    lastCommandMs = millis();
  }

