abt-st/FIRMWARE-UPDATE-QUBE-ESP32/src/firmware/esp32_qube_l298n/esp32_qube_l298n.ino
      // ── Gain Scheduling: elegir gains según magnitud del error ──────────
      float Kp, Ki, Kd;
      if (useGainScheduling) {
        // Histérisis: si estamos en modo fino, solo cambiamos a grueso si err > threshold + hysteresis
        //            si estamos en modo grueso, solo cambiamos a fino si err < threshold - hysteresis
        float upperBound = GAIN_THRESHOLD_DEG + GAIN_HYSTERESIS_DEG;
        float lowerBound = GAIN_THRESHOLD_DEG - GAIN_HYSTERESIS_DEG;

        if (gainMode == 0) {
          // Actualmente en modo fino — cambiar a grueso solo si supera el límite superior
          if (absErr > upperBound) gainMode = 1;
        } else {
          // Actualmente en modo grueso — volver a fino solo si baja del límite inferior
          if (absErr < lowerBound) gainMode = 0;
        }

        if (gainMode == 0) {
          Kp = Kp_fine;   Ki = Ki_fine;   Kd = Kd_fine;
        } else {
          Kp = Kp_coarse; Ki = Ki_coarse; Kd = Kd_coarse;
        }
      } else {
        // PID clásico: usa los gains globales Kp/Ki/Kd
        Kp = ::Kp;  Ki = ::Ki;  Kd = ::Kd;
      }

      // ── Integral anti-windup ────────────────────────────────────────────
      if (absErr < PID_ANTIWIND_ERR_DEG && abs(filteredVel) < PID_ANTIWIND_VEL_DPS) {
        integralTerm += err * dt;
        integralTerm = constrain(integralTerm, -INTEGRAL_LIMIT, INTEGRAL_LIMIT);
      } else {
        integralTerm = 0.0f;
      }

      // ── Velocidad filtrada (EMA) ───────────────────────────────────────
      const float rawVel = -(pos - prevPos) / dt;
      filteredVel = velAlpha * rawVel + (1.0f - velAlpha) * filteredVel;
      prevPos = pos;
      // ── PID output ─────────────────────────────────────────────────────
      float u = Kp * err + Ki * integralTerm + Kd * filteredVel;
      int pwm = (int)(MOTOR_DIR * u);

      // ── Dead band ──────────────────────────────────────────────────────
      const float deadBand = useGainScheduling ? (gainMode == 0 ? DEADBAND_FINE_DEG : DEADBAND_COARSE_DEG) : DEADBAND_CLASSIC_DEG;
      if (absErr <= deadBand) {
        pwm = 0;
      }
      // ── Feedforward gravitacional: compensa torque proporcional a sin(pos) ──
      // Modelo: τ_gravedad ∝ sin(ángulo). Compensa la soft saturation que
      // reduce PWM a medida que el brazo se aleja del centro.
      // ff=15 → ~7.5 PWM a 30°, ~13 PWM a 60°, ~15 PWM a 90°.
      // Calibrar: subir ff hasta que el SS error se minimice.
      const float ff = servo_ff_pwm * sinf(pos * DEG_TO_RAD);
      pwm += (int)(MOTOR_DIR * ff);
      // ── Kick mínimo para vencer fricción ───────────────────────────────
      if (abs(pwm) < PWM_MIN && absErr > STICTION_ERR_THRESH_DEG && abs(filteredVel) < STICTION_VEL_THRESH_DPS) {
        pwm = (pwm >= 0) ? PWM_MIN : -PWM_MIN;
      }

      // ── Limitación dinámica de PWM ─────────────────────────────────────
      int pwmLimit = PWM_MAX;
      if (useGainScheduling) {
        if (gainMode == 0) {
          // Modo fino: PWM acotado para movimientos suaves
          if (absErr < PWM_LIMIT_FINE_NEAR_DEG) pwmLimit = PWM_LIMIT_FINE_NEAR;
          else if (absErr < PWM_LIMIT_FINE_MID_DEG) pwmLimit = PWM_LIMIT_FINE_MID;
        } else {
          // Modo grueso: PWM libre para respuesta rápida
          if (absErr < PWM_LIMIT_COARSE_NEAR_DEG) pwmLimit = PWM_LIMIT_COARSE_NEAR;
        }
      } else {
        // PID clásico: escalonamiento original
        if (absErr < PWM_LIMIT_FINE_NEAR_DEG) pwmLimit = PWM_LIMIT_CLASSIC_NEAR;
        else if (absErr < PWM_LIMIT_FINE_MID_DEG) pwmLimit = PWM_LIMIT_CLASSIC_MID;
        else if (absErr < PWM_LIMIT_COARSE_NEAR_DEG) pwmLimit = PWM_LIMIT_CLASSIC_FAR;
      }

      pwm = constrain(pwm, -pwmLimit, pwmLimit);
      setMotor(pwm);
    } else if (mode == 4) {
      // ── Catch mode: frenar péndulo al entrar a LQR ────────────────────
      int pwm = 0;
      if (lqr_catchMs > 0 && (millis() - lqr_catchMs) < LQR_CATCH_MS) {
        float rawVelForCatch = -(pendPosRaw - lqr_prevAlpha) / dt;
        if (rawVelForCatch > 50.0f) pwm = -60;
        else if (rawVelForCatch < -50.0f) pwm = 60;
        else pwm = 0;
        pwm = constrain(pwm, -60, 60);
        setMotor(pwm);
        return;
      }
      lqr_catchMs = 0;
      const float theta = constrain(pos, -LQR_SERVO_LIMIT_DEG, LQR_SERVO_LIMIT_DEG);
      const float alpha_raw = pendPosRaw;
      // alpha continuo: distancia mínima al vertical (±180°) usando aritmética modular.
      // Evita la discontinuidad de ±180° cuando pendPos cruza el vertical.
      // alpha = 0 en vertical, negativo debajo, positivo arriba (cruzado).
      float alpha = fmodf(alpha_raw - 180.0f, 360.0f);
      if (alpha < -180.0f) alpha += 360.0f;
      else if (alpha > 180.0f) alpha -= 360.0f;
      alpha = -alpha;  // Invertir: negativo=debajo, positivo=arriba

      // Velocidades con filtro EMA (usar ángulo crudo para evitar errores en wrap-around)
      const float rawVelTheta = -(theta - lqr_prevTheta) / dt;
      const float rawVelAlpha = -(alpha_raw - lqr_prevAlpha) / dt;
      lqr_filteredVelTheta = velAlpha * rawVelTheta + (1.0f - velAlpha) * lqr_filteredVelTheta;
      lqr_filteredVelAlpha = VEL_ALPHA_PEND * rawVelAlpha + (1.0f - VEL_ALPHA_PEND) * lqr_filteredVelAlpha;
      lqr_prevTheta = theta;
      lqr_prevAlpha = alpha_raw;  // Guardar crudo para siguiente velocidad

      // Gain scheduling en 3 tiers: base → NEAR → VERY_NEAR
      float k2_eff = lqr_K2;
      float k4_eff = lqr_K4;
      if (abs(alpha) < LQR_VERY_NEAR_DEG) {
        k2_eff = LQR_K2_VERY_NEAR;
        k4_eff = LQR_K4_VERY_NEAR;
      } else if (abs(alpha) < LQR_NEAR_DEG) {
        k2_eff = LQR_K2_NEAR;
        k4_eff = LQR_K4_NEAR;
      }

      // LQR: u = -(K1*theta + K2*alpha + K3*theta_dot + K4*alpha_dot)
      // alpha=0 es la posición vertical (invertido)
      float u = -(lqr_K1 * theta + k2_eff * alpha + lqr_K3 * lqr_filteredVelTheta + k4_eff * lqr_filteredVelAlpha);

      // Energy dissipation dentro de LQR: agregar término de amortiguamiento
      // proporcional a la velocidad angular del péndulo. Esto reduce el ciclo
      // límite alrededor de ±180° sin afectar la estabilidad del LQR.
      if (abs(alpha) < LQR_NEAR_DEG) {
        u -= LQR_DAMPING_GAIN * lqr_filteredVelAlpha;
      }

      pwm = constrain((int)(MOTOR_DIR * u), -70, 70);

      // Servo centering en LQR: mantener el servo cerca del centro para
      // maximizar el rango de actuación y reducir oscilación del servo.
      // Centering agresivo: si el servo se aleja del centro, la fuerza de
      // retorno crece linealmente. Esto previene que el servo pegue contra
      // el stop mecánico y cause brownout.
      {
        float centering_gain = 1.0f;  // Ganancia de centering (era 0.15)
        float centering = -centering_gain * theta;
        pwm += (int)centering;
      }

      // Límite de PWM proporcional a la posición del servo.
      // Cuando |theta| > 50°, reducir PWM máximo para evitar que el servo
      // siga alejándose del centro. Esto es más efectivo que la protección
      // direction-aware que solo actúa en 70°-85°.
      {
        float absTheta = fabsf(theta);
        int servoPwmLimit = 70;
        if (absTheta > 50.0f) {
          // Reducir PWM linealmente: 70 en 50°, 30 en 75°, 0 en 90°
          servoPwmLimit = (int)(70.0f - (absTheta - 50.0f) * (70.0f / 40.0f));
          servoPwmLimit = constrain(servoPwmLimit, 0, 70);
        }
        pwm = constrain(pwm, -servoPwmLimit, servoPwmLimit);
      }

      // Protección: apagar motor si el péndulo acumuló rotación (raw>250°).
      // Usar raw en vez de alpha (wrapped) que cruza ±180° discontinuamente.
      if (fabsf(pendPosRaw) > 250.0f) {
        pwm = 0;
      }

