abt-st/FIRMWARE-UPDATE-QUBE-ESP32/src/firmware/esp32_qube_l298n/esp32_qube_l298n.ino
      // Fallback: si raw>360°, el péndulo hizo una vuelta → LQR falló.
      // Fallback inmediato + reset offset para que swing-up arranque limpio.
      if (fabsf(pendPosRaw) > 360.0f) {
        if (!lqr_inFallback) {
          pendulumOffsetDeg = pendulumDir * getPendulumCountAtomic() * getPendulumDegPerCount();
          prevPosPend = 0.0f;
          pendPosRawPrev = 0.0f;
          setMode(5);
          lqr_inFallback = true;
          Serial.printf("LQR: FALLBACK (raw=%.1f, offset reset)\n", pendPosRaw);
        }
      } else if (fabsf(pendPosRaw) < 30.0f) {
        // Rearm: péndulo cerca del fondo, listo para nuevo intento
        lqr_fallbackMs = 0;
        lqr_inFallback = false;
      }

      // Protección anti-brownout: CORTAR PWM si el servo está contra el stop.
      // Un motor stalled contra hard stop dispara corriente → brownout ESP32.
      // Regla: si |pos| > 80°, cortar cualquier PWM que empuje hacia el stop.
      // Si |pos| > 85°, cortar TODO el PWM (el servo ya pegó).
      if (fabsf(pos) > 85.0f) {
        pwm = 0;
      } else if (fabsf(pos) > 70.0f) {
        // Cortar solo el PWM que empuja hacia el stop (direction-aware)
        float stop_dir = (pos > 0) ? 1.0f : -1.0f;
        float pwm_dir = (pwm > 0) ? 1.0f : ((pwm < 0) ? -1.0f : 0.0f);
        if (pwm_dir == stop_dir) {
          // PWM empuja hacia el stop — reducir proporcionalmente
          float factor = 1.0f - (fabsf(pos) - 70.0f) / 15.0f;  // 1.0 en 70°, 0 en 85°
          pwm = (int)(pwm * constrain(factor, 0.0f, 1.0f));
        }
      }
      pwm = constrain(pwm, -PWM_MAX, PWM_MAX);
      setMotor(pwm);


    // ══════════════════════════════════════════════════════════════════════════
    // MODO 5: Swing-up por energia con kick continuo
    // ══════════════════════════════════════════════════════════════════════════
    } else if (mode == 5) {
      int pwm = 0;
      const float alpha = pendPos * DEG_TO_RAD;         // Wrapped para display
      const float alpha_dot = (pendPosRaw - prevPosPend) / dt * DEG_TO_RAD;
      prevPosPend = pendPosRaw;

      // ── Detección de spinning ──────────────────────────────────────────
      // Si el péndulo acumula >360° en crudo entre samples, está girando.
      float rawDelta = fabsf(pendPosRaw - pendPosRawPrev);
      bool spinning = (rawDelta > 200.0f);  // >200° entre samples = spinning rápido
      pendPosRawPrev = pendPosRaw;

      // Contador de vueltas: si |pendPosRaw| > 360° (1 vuelta), forzar frenado
      if (fabsf(pendPosRaw) > 360.0f) spinning = true;

      const float mgl = PEND_MASS * GRAVITY * PEND_LENGTH;

      // Cooldown post-spin: aplicar freno durante SPIN_COOLDOWN_MS después de detectar spinning
      bool inCooldown = (spinCooldownMs > 0) && ((millis() - spinCooldownMs) < SPIN_COOLDOWN_MS);

      if (spinning || inCooldown) {
        // ── Anti-spin: freno máximo + reset offset ──────────────────────
        if (spinning) {
          // Reset offset INMEDIATAMENTE para que pendPos refleje posición real
          pendulumOffsetDeg = pendulumDir * getPendulumCountAtomic() * getPendulumDegPerCount();
          prevPosPend = 0.0f;
          pendPosRawPrev = 0.0f;
          spinCooldownMs = millis();  // Iniciar cooldown
          Serial.printf("Swing-up: SPIN detected, raw=%.1f, braking + cooldown\n", pendPosRaw);
        }

        // Freno máximo (durante todo el cooldown)
        int brake_pwm = (alpha_dot > 0.0f) ? -PWM_MAX : PWM_MAX;
        pwm = brake_pwm;
      } else {
        // ══════════════════════════════════════════════════════════════════
        // TRANSICIÓN A LQR: chequear ANTES de recovery/damping.
        // Si el péndulo está cerca de la vertical con baja velocidad,
        // transicionar inmediatamente sin entrar en recovery.
        // ══════════════════════════════════════════════════════════════════
        float vel_raw_dps = fabsf(alpha_dot) * RAD_TO_DEG;
        bool inUpperHemisphere = fabsf(pendPos) > 165.0f;
        bool nearlyStopped = vel_raw_dps < 10.0f;
        bool canTransition = inUpperHemisphere && nearlyStopped;

        if (canTransition) {
          float dist_from_up = 180.0f - fabsf(pendPos);
          if (dist_from_up < balance_threshold) {
            setMode(4);
            lqr_inFallback = false;
            lqr_catchMs = millis();
            spinCooldownMs = 0;
            Serial.printf("Swing-up: TRANSICION a LQR (pend=%.1f, vel=%.1f, raw=%.1f)\n", pendPos, vel_raw_dps, pendPosRaw);
            pwm = 0;
            setMotor(pwm);
            return;  // Salir del control loop — modo ya cambió a 4
          }
        }

        // ── Recovery: péndulo cruzó la vertical sin transicionar ───────
        if (swing_recovering) {
          // RECOVERY activo: motor apagado, esperando que el péndulo caiga al fondo.
          pwm = 0;
          if (fabsf(pendPos) < SWING_RECOVERY_THRESHOLD) {
            swing_recovering = false;
            // Reset offset al salir de recovery para que raw esté en [-180,180]
            pendulumOffsetDeg = pendulumDir * getPendulumCountAtomic() * getPendulumDegPerCount();
            prevPosPend = 0.0f;
            pendPosRawPrev = 0.0f;
            Serial.printf("Swing-up: recovery COMPLETE (pend=%.1f)\n", pendPos);
          }
        } else if (fabsf(pendPosRaw) > 180.0f) {
          // El péndulo cruzó la vertical sin transicionar → recovery.
          // Reset offset para que raw se mantenga acotado.
          swing_recovering = true;
          pwm = 0;
          setMotor(0);
          pendulumOffsetDeg = pendulumDir * getPendulumCountAtomic() * getPendulumDegPerCount();
          prevPosPend = 0.0f;
          pendPosRawPrev = 0.0f;
          Serial.printf("Swing-up: RECOVERY START (raw=%.1f, pend=%.1f, vel=%.1f)\n", pendPosRaw, pendPos, vel_raw_dps);
        } else if (fabsf(pendPosRaw) > 120.0f) {
          // ── Damping progresivo: disipar energía desde 120° hasta la vertical ──
          float dampStrength = (fabsf(pendPosRaw) - 120.0f) / 60.0f;
          dampStrength = constrain(dampStrength, 0.0f, 1.0f);
          float damping = -(0.3f + 0.7f * dampStrength) * alpha_dot;
          pwm = constrain((int)(MOTOR_DIR * damping * PWM_MAX), -PWM_MAX, PWM_MAX);
        } else {
          // ── Bombeo normal de energía ──────────────────────────────────
          const float alpha_energy_rad = pendPosRaw * DEG_TO_RAD;
          const float prod = alpha_dot * cosf(alpha_energy_rad);
          float motion_sign = 0.0f;
          if (prod > SWINGUP_PROD_DEADZONE) motion_sign = 1.0f;
          else if (prod < -SWINGUP_PROD_DEADZONE) motion_sign = -1.0f;

          if (fabsf(alpha_dot) < SWINGUP_QUIET_THRESHOLD_RADPS) {
            // Kick alternante cuando el péndulo está quieto + centering
            if (((millis() / SWINGUP_KICK_PERIOD_MS) % 2) == 0) {
              pwm = MOTOR_DIR * (int)(50 * SWINGUP_KICK_DUTY_FRAC);
            } else {
              pwm = -MOTOR_DIR * (int)(50 * SWINGUP_KICK_DUTY_FRAC);
            }
            float centering_kp = 0.2f;
            pwm += (int)(-centering_kp * pos);
          } else {
            // Bombeo de energía basado en sign(α̇·cos α)
            float u = ke_gain * motion_sign;
            pwm = (int)(MOTOR_DIR * u * PWM_MAX);
          }
        }
      }

      // Frenado progresivo + activo del servo
      const float SWINGUP_BRAKE_START = 70.0f;
      const float SWINGUP_BRAKE_END = 90.0f;
      const float abs_pos = fabsf(pos);
      if (abs_pos > SWINGUP_BRAKE_START) {
        if (abs_pos < SWINGUP_BRAKE_END) {
          // 70-90°: reducir PWM gradualmente
          float brake_factor = 1.0f - (abs_pos - SWINGUP_BRAKE_START) / (SWINGUP_BRAKE_END - SWINGUP_BRAKE_START);
          if ((pos > 0 && pwm > 0) || (pos < 0 && pwm < 0)) {
            pwm = (int)(pwm * brake_factor);
          }
        } else {
          // >90°: freno activo — PWM inverso para contrarrestar el momento
          int brake_pwm = (int)((abs_pos - SWINGUP_BRAKE_END) * 1.5f);
          brake_pwm = constrain(brake_pwm, 0, PWM_MAX);
          pwm = (pos > 0) ? -brake_pwm : brake_pwm;
        }
      }
      pwm = constrain(pwm, -PWM_MAX, PWM_MAX);
      setMotor(pwm);
    }
  }
  const unsigned long nowMs = millis();

  // Failsafe: si no hay comandos recientes en modos activos, detener.
  if (ENABLE_COMMAND_TIMEOUT && mode >= 1 && mode <= 5 && (nowMs - lastCommandMs > COMMAND_TIMEOUT_MS)) {
    safeStop();
  }

  if (nowMs - lastTelemetryMs >= telemetryPeriodMs) {
    lastTelemetryMs = nowMs;
    const long c = getEncoderCountAtomic();
    const float pos = encoderDir * c * getDegPerCount() - positionOffsetDeg;
    const long pc = getPendulumCountAtomic();
    const float pendPos = pendulumDir * pc * getPendulumDegPerCount() - pendulumOffsetDeg;

    updateIna219();

    Serial.print("POS:");
    Serial.print(pos, 2);
    Serial.print(" CNT:");
    Serial.print(c);
    Serial.print(" PPOS:");
    Serial.print(pendPos, 2);
    Serial.print(" PCNT:");
    Serial.print(pc);
    Serial.print(" PA:");
    Serial.print(digitalRead(PIN_PEND_A));
    Serial.print(" PB:");
    Serial.print(digitalRead(PIN_PEND_B));
    Serial.print(" SP:");
    Serial.print(setpoint_deg, 2);
    Serial.print(" PWM:");
    Serial.print(lastPwmCmd);
    Serial.print(" M:");
    Serial.print(mode);
    if (inaOk) {
      Serial.print(" V:");
      Serial.print(busVoltageV, 2);
      Serial.print(" I[mA]:");
      Serial.print(currentmA, 1);
      Serial.print(" P[mW]:");
      Serial.print(powermW, 1);
    }
    Serial.println();
    // Broadcast via WebSocket to connected clients
    broadcastTelemetry();
  }
}
